const SPECIAL_CHAREACTER = /[-\/\\^$*+?.()|[\]{}]/g;

export const normalizeRemoveAccent = (text: string) => {
  return removeAccents(text)
    .trim()
    .replace(SPECIAL_CHAREACTER, '')
    .split(' ')
    .filter((word: string) => word)
    .join(' ')
    .replace(/ /g, '-');
};

// data [CHARACTER_MAP] from https://www.npmjs.com/package/remove-accents

const CHARACTER_MAP: any = {
  'A': 'À|Á|Ã|Ạ|Ả|Â|Ã|Ä|Å|Ấ|Ắ|Ẳ|Ẵ|Ặ|Ầ|Ằ|Ȃ|Ấ|Ẩ|Ậ|Ẫ|Ầ|Ā|Ă|Ẵ|Ẳ|Ằ|Ắ|Ặ|Ą|Ǎ|Ǻ|A̋|Ȁ|A̧',
  'AE': 'Æ|Ǽ',
  'C': 'Ç|Ḉ|Ć|Ĉ|Ċ|Č|C̆|Č̣',
  'E': 'È|É|Ẻ|Ẽ|Ẹ|Ê|Ế|Ề|Ể|Ễ|Ệ|Ë|Ế|Ḗ|Ề|Ḕ|Ḝ|Ȇ|Ē|Ĕ|Ė|Ę|Ě|E̋|Ȅ|Ê̌|Ȩ|Ɛ̧',
  'I': 'Ì|Í|Ị|Ĩ|Ỉ|Î|Ï|Ḯ|Ȋ|Ĩ|Ī|Ĭ|Į|İ|Ǐ|I̋|Ȉ|I̧|Ɨ̧',
  'D': 'Ð|Ď|Đ|Ḑ',
  'N': 'Ñ|Ń|Ņ|Ň|N̆|Ǹ',
  'O': 'Ọ|Ỏ|Õ|Ò|Ó|Ô|Ố|Ồ|Ộ|Ỗ|Ổ|Ö|Ø|Ố|Ṍ|Ṓ|Ȏ|Ō|Ŏ|Ő|Ơ|Ớ|Ở|Ỡ|Ợ|Ở|Ǒ|Ǿ|Ồ|Ṑ|Ȍ|O̧',
  'U': 'Ù|Ú|Ủ|Ũ|Ụ|Û|Ü|Ũ|Ū|Ŭ|Ů|Ű|Ų|Ȗ|Ư|Ứ|Ừ|Ử|Ữ|Ự|Ǔ|Ǖ|Ǘ|Ǚ|Ǜ|Ứ|Ṹ|Ừ|Ȕ|U̧',
  'Y': 'Ý|Ỹ|Ỷ|Ỵ|Ÿ|Y̆|Ỳ|Y̌',
  'a': 'à|á|ã|ạ|ả|â|ã|ä|å|ấ|ắ|ẳ|ẵ|ặ|ầ|ằ|ȃ|ấ|ẩ|ậ|ẫ|ầ|ā|ă|ẵ|ẳ|ằ|ắ|ặ|ą|ǎ|ǻ|a̋|ȁ|a̧',
  'ae': 'æ|ǽ',
  'c': 'ç|ḉ|ć|ĉ|ċ|č|c̆|č̣',
  'e': 'è|é|ẻ|ẽ|ẹ|ê|ể|ệ|ễ|ề|ế|ë|ế|ḗ|ề|ḕ|ḝ|ȇ|ē|ĕ|ė|ę|ě|e̋|ȅ|ê̌|ȩ|ɛ̧',
  'i': 'ì|í|ĩ|ỉ|ị|î|ï|ḯ|ȋ|ĩ|ī|ĭ|į|ı|ǐ|i̋|ȉ|i̧|ɨ̧',
  'd': 'ð|ď|đ|ḑ',
  'n': 'ñ|ń|ņ|ň|ŉ|n̆|ǹ',
  'o': 'ò|ó|ọ|õ|ỏ|ô|ổ|ỗ|ộ|ồ|ố|õ|ö|ø|ố|ṍ|ṓ|ȏ|ō|ŏ|ő|ơ|ớ|ở|ợ|ỡ|ờ|ǒ|ǿ|ồ|ṑ|ȍ|o̧',
  'u': 'ù|ú|ũ|ủ|ụ|û|ü|ũ|ū|ŭ|ů|ű|ų|ȗ|ư|ǔ|ǖ|ǘ|ǚ|ǜ|ứ|ṹ|ừ|ử|ự|ữ|ȕ|u̧',
  'y': 'ý|ỷ|ỹ|ỵ|ÿ|ŷ|y̆|ỳ|y̌',
  'G': 'Ĝ|Ǵ|Ğ|Ġ|Ģ|Ǧ',
  'g': 'ĝ|ǵ|ğ|ġ|ģ|ǧ',
  'H': 'Ĥ|Ħ|Ḫ|Ȟ|Ḩ',
  'h': 'ĥ|ħ|ḫ|ȟ|ḩ',
  'IJ': 'Ĳ',
  'ij': 'ĳ',
  'J': 'Ĵ|J̌',
  'j': 'ĵ|ǰ',
  'K': 'Ķ|Ḱ|K̆|Ǩ',
  'k': 'ķ|ḱ|k̆|ǩ',
  'L': 'Ĺ|Ļ|Ľ|Ŀ',
  'l': 'ĺ|ļ|ľ|ŀ|Ł|ł',
  'M': 'Ḿ|M̆|M̌|M̧',
  'm': 'ḿ|m̆|m̌|m̧',
  'OE': 'Œ',
  'oe': 'œ',
  'P': 'P̆|Ṕ|P̌',
  'p': 'p̆|ṕ|p̌',
  'R': 'Ŕ|Ŗ|Ř|R̆|Ȓ|Ȑ|Ř̩',
  'r': 'ŕ|ŗ|ř|r̆|ȓ|ȑ|ř̩',
  'S': 'Ś|Ŝ|Ş|Ș|Š|Ṥ|Ṧ',
  's': 'ś|ŝ|ș|ş|š|ſ|ṥ|ṧ',
  'T': 'Ţ|Ț|Ť|Ŧ|T̆',
  't': 'ţ|ț|ť|ŧ|t̆',
  'V': 'V̆|V̌',
  'v': 'v̆|v̌',
  'W': 'Ŵ|Ẃ|Ẁ|W̌',
  'w': 'ŵ|ẃ|ẁ|w̌',
  'X': 'X̆|X́|X̌|X̧',
  'x': 'x̆|x́|x̌|x̧',
  'Z': 'Ź|Ż|Ž|Z̧',
  'z': 'ź|ż|ž|z̧',
  'f': 'ƒ|f̌',
  'TH': 'Þ',
  'th': 'þ',
  'Г': 'Ѓ',
  'г': 'ѓ',
  'К': 'Ќ',
  'к': 'ќ',
  'B': 'B̌|B̧',
  'b': 'b̌|b̧',
  'F': 'F̌',
  'Q': 'Q̌|Q̧',
  'q': 'q̌|q̧'
};

Object.freeze(CHARACTER_MAP);

const removeAccents = (text: string) => {
  return Object
  .keys(CHARACTER_MAP)
  .reduce((acc, cur) =>
    acc.replace(new RegExp(CHARACTER_MAP[cur], 'g'), cur)
    , text
  );
};

